[
  {
    "title": "The Lord of the Rings",
    "author": "J. R. R. Tolkien",
    "coverImageUrl": "https://images-na.ssl-images-amazon.com/images/I/51r6XIPWmoL._SX331_BO1,204,203,200_.jpg",
    "id": "618645616",
    "pageCount": 1178,
    "publisher": "Houghton Mifflin Harcourt",
    "synopsis": "In ancient times the Rings of Power were crafted by the Elven-smiths, and Sauron, the Dark Lord, forged the One Ring, filling it with his own power so that he could rule all others. But the One Ring was taken from him, and though he sought it throughout Middle-earth, it remained lost to him. After many ages it fell by chance into the hands of the hobbit Bilbo Baggins."
  },
  {
    "title": "The Hobbit",
    "author": "J. R. R. Tolkien",
    "coverImageUrl": "https://images-na.ssl-images-amazon.com/images/I/61VxEKq8B1L._SX365_BO1,204,203,200_.jpg",
    "id": "547928246",
    "pageCount": 320,
    "publisher": "Houghton Mifflin Harcourt",
    "synopsis": "Bilbo Baggins is a hobbit who enjoys a comfortable, unambitious life, rarely traveling any farther than his pantry or cellar. But his contentment is disturbed when the wizard Gandalf and a company of dwarves arrive on his doorstep one day to whisk him away on an adventure. They have launched a plot to raid the treasure hoard guarded by Smaug the Magnificent, a large and very dangerous dragon. Bilbo reluctantly joins their quest, unaware that on his journey to the Lonely Mountain he will encounter both a magic ring and a frightening creature known as Gollum."
  },
  {
    "title": "Harry Potter and the Chamber of Secrets",
    "author": "J. K. Rowling",
    "coverImageUrl": "https://images-na.ssl-images-amazon.com/images/I/51jNORv6nQL._SX340_BO1,204,203,200_.jpg",
    "id": "439064872",
    "pageCount": 341,
    "publisher": "Scholastic",
    "synopsis": "Ever since Harry Potter had come home for the summer, the Dursleys had been so mean and hideous that all Harry wanted was to get back to the Hogwarts School for Witchcraft and Wizardry. But just as he's packing his bags, Harry receives a warning from a strange, impish creature who says that if Harry returns to Hogwarts, disaster will strike. And strike it does. For in Harry's second year at Hogwarts, fresh torments and horrors arise, including an outrageously stuck-up new professor and a spirit who haunts the girls' bathroom. But then the real trouble begins -- someone is turning Hogwarts students to stone. Could it be Draco Malfoy, a more poisonous rival than ever? Could it possibly be Hagrid, whose mysterious past is finally told? Or could it be the one everyone at Hogwarts most suspects...Harry Potter himself!"
  },
  {
    "title": "Harry Potter and the Prisoner of Azkaban",
    "author": "J. K. Rowling",
    "coverImageUrl": "https://images-na.ssl-images-amazon.com/images/I/51IiQ4r35LL._SX345_BO1,204,203,200_.jpg",
    "id": "439136369",
    "pageCount": 448,
    "publisher": "Scholastic",
    "synopsis": "In this third installment in the projected seven-volume series, Sirius Black, imprisoned for killing 13 people with one curse, escapes from Azkaban. As he heads for Hogwarts, the chilling Dementors who trail him quickly descend upon the school. \"Each successive volume expands upon its predecessor with dizzyingly well-planned plots and inventive surprises,\" said PW in a Best Books of 2001 citation. Ages 8-up."
  },
  {
    "title": "Harry Potter and the Goblet of Fire",
    "author": "J. K. Rowling",
    "coverImageUrl": "https://images-na.ssl-images-amazon.com/images/I/51OORp1XD1L._SX421_BO1,204,203,200_.jpg",
    "id": "439139600",
    "pageCount": 752,
    "publisher": "Scholastic",
    "synopsis": "Harry Potter is midway through his training as a wizard and his coming of age. Harry wants to get away from the pernicious Dursleys and go to the International Quidditch Cup. He wants to find out about the mysterious event that's supposed to take place at Hogwarts this year, an event involving two other rival schools of magic, and a competition that hasn't happened for a hundred years. He wants to be a normal, fourteen-year-old wizard. But unfortunately for Harry Potter, he's not normal - even by wizarding standards. And in his case, different can be deadly."
  },
  {
    "title": "A Brief History of Time",
    "author": "Stephen Hawking",
    "coverImageUrl": "https://images-na.ssl-images-amazon.com/images/I/51%2BGySc8ExL._SX333_BO1,204,203,200_.jpg",
    "id": "553380168",
    "pageCount": 212,
    "publisher": "Bantam",
    "synopsis": "Told in language we all can understand, A Brief History of Time plunges into the exotic realms of black holes and quarks, of antimatter and “arrows of time,” of the big bang and a bigger God—where the possibilities are wondrous and unexpected. With exciting images and profound imagination, Stephen Hawking brings us closer to the ultimate secrets at the very heart of creation."
  },
  {
    "title": "The Little Prince",
    "author": "Antoine de St. Exupéry",
    "coverImageUrl": "https://images-na.ssl-images-amazon.com/images/I/4186P0mACWL._SX336_BO1,204,203,200_.jpg",
    "id": "156012197",
    "pageCount": 96,
    "publisher": "Mariner Books",
    "synopsis": "Few stories are as widely read and as universally cherished by children and adults alike as The Little Prince. Richard Howard's translation of the beloved classic beautifully reflects Saint-Exupéry's unique and gifted style. Howard, an acclaimed poet and one of the preeminent translators of our time, has excelled in bringing the English text as close as possible to the French, in language, style, and most important, spirit. The artwork in this edition has been restored to match in detail and in color Saint-Exupéry's original artwork. Combining Richard Howard's translation with restored original art, this definitive English-language edition of The Little Prince will capture the hearts of readers of all ages."
  },
  {
    "title": "The Phantom Tolbooth",
    "author": "Norton Juster",
    "coverImageUrl": "https://images-na.ssl-images-amazon.com/images/I/51QC8X%2BTDyL._SX340_BO1,204,203,200_.jpg",
    "id": "394820371",
    "pageCount": 272,
    "publisher": "Bullseye Books",
    "synopsis": "For Milo, everything’s a bore. When a tollbooth mysteriously appears in his room, he drives through only because he’s got nothing better to do. But on the other side, things seem different. Milo visits the Island of Conclusions (you get there by jumping), learns about time from a ticking watchdog named Tock, and even embarks on a quest to rescue Rhyme and Reason! Somewhere along the way, Milo realizes something astonishing. Life is far from dull. In fact, it’s exciting beyond his wildest dreams. . . ."
  },
  {
    "title": "Bridge to Terebithia",
    "author": "Katherine Paterson",
    "coverImageUrl": "https://images-na.ssl-images-amazon.com/images/I/51cYMLz-YQL._SX334_BO1,204,203,200_.jpg",
    "id": "64401847",
    "pageCount": 144,
    "publisher": "HarperCollins",
    "synopsis": "Jess Aarons has been practicing all summer so he can be the fastest runner in the fifth grade. And he almost is, until the new girl in school, Leslie Burke, outpaces him. The two become fast friends and spend most days in the woods behind Leslie’s house, where they invent an enchanted land called Terabithia. One morning, Leslie goes to Terabithia without Jess and a tragedy occurs. It will take the love of his family and the strength that Leslie has given him for Jess to be able to deal with his grief"
  },
  {
    "title": "Winnie the Pooh",
    "author": "A. A. Milne",
    "coverImageUrl": "https://images-na.ssl-images-amazon.com/images/I/41O90KgELyL._SX345_BO1,204,203,200_.jpg",
    "id": "525555315",
    "pageCount": 176,
    "publisher": "Dutton Books for Young Readers",
    "synopsis": "For over ninety years, Winnie-the-Pooh and his friends—Piglet, Owl, Tigger, and the ever doleful Eeyore—have endured as the unforgettable creations of A.A. Milne, who wrote this book for his son, Christopher Robin, and Ernest H. Shepard, who lovingly gave Pooh and his companions shape through his illustrations."
  },
  {
    "title": "Learning React Native: Building Native Mobile Apps with JavaScript",
    "author": "Bonnie Eisenman",
    "coverImageUrl": "https://images-na.ssl-images-amazon.com/images/I/518ctEpEw1L._SX379_BO1,204,203,200_.jpg",
    "id": "1491989149",
    "pageCount": 242,
    "publisher": "O'Reilly Media",
    "synopsis": "Get a practical introduction to React Native, the JavaScript framework for writing and deploying fully featured mobile apps that render natively. The second edition of this hands-on guide shows you how to build applications that target iOS, Android, and other mobile platforms instead of browsers—apps that can access platform features such as the camera, user location, and local storage."
  }
]
